const Main = require('./main.js');
var shape = Main.shape;

const Common = require('./common.js');
var printArr = Common.printArr;

/*

实现numpy.broadcast方法

关于numpy.broadcast方法的运行基本操作，请看“broadcast.py”细心看，一看你就能明白

第一步，检查两个数组，能否使用广播机制

第二步，如果两个数组，可以使用广播机制，则进行广播处理
*/

function broadcast(arr1, arr2) {

    //第一步、检查两个数组是否支持广播机制
    let arr1Shape = shape(arr1);
    let arr2Shape = shape(arr2)

    let arr1ShapeReverse = arr1Shape.reverse();
    let arr2ShapeReverse = arr2Shape.reverse();

    for(let i=0;i<arr1ShapeReverse.length;i++){
        let arr1Item = arr1ShapeReverse[i] || 1;
        let arr2Item = arr2ShapeReverse[i] || 1;

        if(arr1Item != arr2Item){
            if(arr1Item != 1 && arr2Item != 1){
                throw new Error('broadcast:error arr1 与 arr2 无法使用广播机制！');
            }
        }
    }


    //第二步、处理两个数组

    //主要分为两个小方法
    //第一个小方法，维度数不够，补1的方法

    //第二个小方法，维度数1，变成对应的维度的小方法
    //下面是关于第二个小方法，运行时的一些小细节
    /*
    举个栗子1
    如两个数组 a1 和 b1 
    他们的形状分别是 a1.shape=[4,3]，b1.shape=[1,3]
    这里我们发现b1.shape下标0处是1，所以b1.shape第0处，需要根据a1.shape下标第0处变化
    a1.shape第0处是4，所以b1.shape第0处需要变化成4
    --
    首先 准备好需要变形的数组b1，再然后告诉“变形方法”这个数组形状的下标第几处需要变化（或数组的第几维需要变化），再再然后告诉“变形方法”需要变成多少
    然后正常的for循环b1数组（所谓正常的，就是，从数组外往数组里循环），循环数组元素，一个一个的循环，当循环到数组里需要变化的维度的时候，根据要求循环复制相关数据，并把循环复制好的数据，存到一个临时对象里，然后在对象里，给循环复制好的这个数据，标记好位置坐标。在然后等待for循环结束后，根据坐标，将循环复制好的数据存入b1数组。
    
    */


}



/*实验*/
let a1 = [
    [0, 0, 0],
    [0, 0, 0],
    [0, 0, 0],
    [0, 0, 0],
]
let b1 = [1, 2, 3]
// broadcast(a1,b1) //啥的都没打印，所以是正常的

let a2 = [
    [
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0]
    ],
    [
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0]
    ],
    [
        [0, 0],
        [0, 0],
        [0, 0],
        [0, 0]
    ]
]
let b2 = [
    [1, 2],
    [3, 4],
    [5, 6],
    [7, 8]
]
// broadcast(a2,b2) //啥的都没打印，所以是正常的

let a3 = [
    [
        [0, 0, 0],
        [0, 0, 0],
        [0, 0, 0]
    ],
    [
        [0, 0, 0],
        [0, 0, 0],
        [0, 0, 0]
    ],
    [
        [0, 0, 0],
        [0, 0, 0],
        [0, 0, 0]
    ],
    [
        [0, 0, 0],
        [0, 0, 0],
        [0, 0, 0]
    ]
]
let b3 = [
    [
        [1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]
    ],
    [
        [10, 11, 12],
        [13, 14, 15],
        [16, 17, 18]
    ]
]
// broadcast(a3,b3) //抛错了，所以是正常的

let a4 = [
    [
        [0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0],
    ],
    [
        [0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0],
    ],
    [
        [0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0],
    ]
]
let b4 = [
    [
        [1, 2, 3, 4, 5, 6],
    ],
    [
        [7, 8, 9, 10, 11, 12],
    ],
    [
        [13, 14, 15, 16, 17, 18],
    ]
]
// broadcast(a4,b4) //啥的都没打印，所以是正常的

let a5 = [
    [0],
    [1],
    [2]
]
let b5 = [0,1,2]
// broadcast(a5,b5) //啥的都没打印，所以是正常的

let a6 = [0,0,0]
let b6 = [1]
// broadcast(a6,b6) //啥的都没打印，所以是正常的