# 基础索引案例

import numpy as np

a = np.arange(4*3*2).reshape(4,3,2)
print(a)
# [[[ 0  1]
#   [ 2  3]
#   [ 4  5]]

#  [[ 6  7]
#   [ 8  9]
#   [10 11]]

#  [[12 13]
#   [14 15]
#   [16 17]]

#  [[18 19]
#   [20 21]
#   [22 23]]]

'''
a[1]

1、补全索引；被索引数组是3维数组，这里被索引数组的第1个维度有索引参数，需要为第2,3个维度补充 :/::/slice(None)
a.shape  [4,3,2]
index    [1,:,:]
result   []

2、预测索引结果形状；被索引数组是3维数组，所以索引在不使用 np.newaxis/None 的情况下，索引结果最多也是一个3维数组
a.shape  [4,3,2]
index    [1,:,:]
result   []

被索引数组从左数第1个维度的索引参数是 整数1，不是切片，所以索引结果形状第1个维度，去除
a.shape  [4,3,2]
index    [1,:,:]
result   [-,]

被索引数组从左数第2,3个维度的索引参数是 :/::/slice(None)，所以索引结果形状第2,3维度，忽略保持不变
a.shape  [4,3,2]
index    [1,:,:]
result   [-,3,2]

结果形状 [3,2]

--------------------

a[:,1]

1、补全索引；被索引数组是3维数组，这里被索引数组的第1,2个维度有索引参数，需要为第3个维度补充 :/::/slice(None)
a.shape  [4,3,2]
index    [:,1,:]
result   []

2、预测索引结果形状
a.shape  [4,3,2]
index    [:,1,:]
result   []

被索引数组从左数第1个维度的索引参数是 :/::/slice(None) ，所以索引结果形状第1个维度，忽略保持不变
a.shape  [4,3,2]
index    [:,1,:]
result   [4]
被索引数组从左数第2个维度的索引参数是 整数1，所以索引结果形状第2个维度，去除
a.shape  [4,3,2]
index    [:,1,:]
result   [4,-]
被索引数组从左数第3个维度的索引参数是 :/::/slice(None) ，所以索引结果形状第3个维度，忽略保持不变
a.shape  [4,3,2]
index    [:,1,:]
result   [4,-,2]

结果形状 [4,2]

--------------------

a[...,1]

1、补全索引；被索引数组是3维数组，索引里有 ... ,被索引数组最后一维有索引参数，根据 ... 与 最后一维有参数 来判断，应将 ... 去除，然后为被索引数组第1,2个维度补充 :/::/slice(None)
a.shape  [4,3,2]
index    [:,:,1]
result   []

2、预测索引结果形状
a.shape  [4,3,2]
index    [:,:,1]
result   []

被索引数组从左数第1,2个维度的索引参数是 :/::/slice(None) ，所以索引结果形状第1,2个维度，忽略保持不变
a.shape  [4,3,2]
index    [:,:,1]
result   [4,3]

被索引数组从左数第3个维度的索引参数是 整数1，所以索引结果形状第3个维度，去除
a.shape  [4,3,2]
index    [:,:,1]
result   [4,3,-]

结果形状 [4,3]

--------------------

a[1:,:,1]

1、补全索引；根据被索引数组第一个维度的信息，为切片补充参数
a.shape  [4,3,2]
index    [1:4:1,:,1]
result   []

2、预测索引结果形状
a.shape  [4,3,2]
index    [1:4:1,:,1]
result   []

被索引数组从左数第1个维度的索引参数是 切片slice(1,4,1)，所以索引结果形状第1个维度，的结果是3
a.shape  [4,3,2]
index    [1:4:1,:,1]
result   [3]

被索引数组从左数第2个维度的索引参数是 :/::/slice(None) ，所以索引结果形状第2个维度，忽略保持不变
a.shape  [4,3,2]
index    [1:4:1,:,1]
result   [3,3]

被索引数组从左数第3个维度的索引参数是 整数1，所以索引结果形状第3个维度，去除
a.shape  [4,3,2]
index    [1:4:1,:,1]
result   [3,3,-]

结果形状 [3,3]

--------------------

a[1:,:1,1]

1、补全索引；根据被索引数组第1,2个维度的信息，为切片补充参数
a.shape  [4,3,2]
index    [1:4:1,0:1:1,1]
result   []

2、预测索引结果形状
a.shape  [4,3,2]
index    [1:4:1,0:1:1,1]
result   []

被索引数组从左数第1个维度的索引参数是 切片slice(1,4,1)，所以索引结果形状第1个维度，的结果是3
a.shape  [4,3,2]
index    [1:4:1,0:1:1,1]
result   [3]

被索引数组从左数第2个维度的索引参数是 切片slice(0,1,1)，所以索引结果形状第2个维度，的结果是1
a.shape  [4,3,2]
index    [1:4:1,0:1:1,1]
result   [3,1]

被索引数组从左数第3个维度的索引参数是 整数1，所以索引结果形状第3个维度，去除
a.shape  [4,3,2]
index    [1:4:1,0:1:1,1]
result   [3,1,-]

结果形状 [3,1]

--------------------

a[...,1]

a[...,None,1]

a[...,1,None]

'''





