import numpy as np

x = np.arange(2*3*4).reshape(2,3,4)
print(x)
# array([[[ 0,  1,  2,  3],
#         [ 4,  5,  6,  7],
#         [ 8,  9, 10, 11]],

#        [[12, 13, 14, 15],
#         [16, 17, 18, 19],
#         [20, 21, 22, 23]]])

print(x[1,...])
# array([[12, 13, 14, 15],
#        [16, 17, 18, 19],
#        [20, 21, 22, 23]])
print(x[1,...].shape)
# (3, 4)

print(x[:,1,:])
# array([[ 4,  5,  6,  7],
#        [16, 17, 18, 19]])
print(x[:,1,:].shape)
# (2, 4)

print(x[...,1])
# array([[ 1,  5,  9],
#        [13, 17, 21]])
print(x[...,1].shape)
# (2, 3)

a = np.arange(10)
print(a)
# array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])
print(a.shape)
# (10,)
print(a.ndim)
# 1    维度是1
print(a[3])
# 3     维度是1，返回的是数组的标量，什么是数组标量，数组里的0, 1, 2, 3, 4, 5, 6, 7, 8, 9就是数组标量

# 在计算机编程中，通常把一个变量的值称为“标量”。而对于一个数组来说，它包含多个元素，每个元素都是一个标量。
# 因此，对于数组a=[1,2,3,4]来说，1、2、3、4都是a数组中的元素，每个元素都是一个标量。而不会单独称呼某个元素为“数组标量”。